testdata/bfs/simpleFoam_kE/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          127092;
        startFace       125957;
    }
    inlet
    {
        type            patch;
        nFaces          57;
        startFace       253049;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       253106;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2149;
        startFace       253170;
    }
)

// ************************************************************************* //
