testdata/bfs/simpleFoam_kE/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime 	0;

stopAt          endTime;

endTime 	2000;

deltaT          1;

writeInterval 	$endTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

libs
(
);

functions
{
	residuals
	{
		type solverInfo;
		libs (utilityFunctionObjects);
		fields (".*");
	}
	
	yPlus1
	{
		type            yPlus;
		libs            (fieldFunctionObjects);
		
		region		wall;
		startTime	2000;
		writeControl	writeTime;
	}
}

// ************************************************************************* //
